from gtts import gTTS
import os
import random as r
import time
wicket=wicket_2=0
toss={1:'Heads',2:'Tails'}
t=r.randint(1,2)
run=run_2=0
if(t==1):
    print("मंच तैयार है, रोशनी चमक रही है और दर्शक दीवाने हैं – शुरू होने वाला है एक और धमाकेदार मुकाबला! \nक्रिकेट प्रेमियों, स्वागत है IPL के महासंग्राम में!आज आमने-सामने हैं दो बड़ी टीमें – टीम A बनाम टीम B!जुनून अपनी चरम सीमा पर है, दर्शक बेकाबू हैं, और मैदान पर होने वाली है आग की बारिश!क्योंकि ये सिर्फ मैच नहीं – ये है क्रिकेट का महायुद्ध! \nTeam A:",toss[t],"\nTeam B:",toss[2])
 
else:
    print("मंच तैयार है, रोशनी चमक रही है और दर्शक दीवाने हैं – शुरू होने वाला है एक और धमाकेदार मुकाबला! \nक्रिकेट प्रेमियों, स्वागत है IPL के महासंग्राम में!आज आमने-सामने हैं दो बड़ी टीमें – टीम A बनाम टीम B!जुनून अपनी चरम सीमा पर है, दर्शक बेकाबू हैं, और मैदान पर होने वाली है आग की बारिश!क्योंकि ये सिर्फ मैच नहीं – ये है क्रिकेट का महायुद्ध! \nTeam A:",toss[t],"\nTeam B:",toss[1])
w=r.randint(1,2)
toss={1:'Batting',2:'Balling'}
choose=r.randint(1,2)
over=7
if(w==t):
    print("हम स्टेडियम से लाइव हैं और अब वक्त है टॉस का!टीम A और टीम B के कप्तान मैदान पर मौजूद हैं मैच रैफरी के साथ।सिक्का हवा में उछाला गया है... और टॉस टीम A ने जीत लिया है")
    if(w==1):
        bat="Team A"
    else:
        bat="Team B"
    print('उन्होंने पहले',toss[choose],'अब शुरू होगा असली मुकाबला')
else:
    print("हम स्टेडियम से लाइव हैं और अब वक्त है टॉस का!टीम A और टीम B के कप्तान मैदान पर मौजूद हैं मैच रैफरी के साथ।सिक्का हवा में उछाला गया है...🪙 और टॉस टीम B ने जीत लिया है!")
    if(w==1):
        bat="Team A"
    else:
        bat="Team B"    
    print('उन्होंने पहले',toss[choose],'अब शुरू होगा असली मुकाबला')
ball={1:1,2:2,3:3,4:4,5:6,6: "ओह नहीं! बल्लेबाज़ों के बीच तालमेल की कमी...फील्डर ने गेंद उठाई, सीधा थ्रो... और सीधा विकेटों पर हिट!शानदार फील्डिंग – बड़ा विकेट, रन आउट कर दिया गया है!",7: "ओह नहीं! बल्लेबाज़ों के बीच तालमेल की कमी...फील्डर ने गेंद उठाई, सीधा थ्रो... और सीधा विकेटों पर हिट!शानदार फील्डिंग – बड़ा विकेट, रन आउट कर दिया गया है!",8:' "ओह नहीं! बल्लेबाज़ों के बीच तालमेल की कमी...फील्रने गेंद उठाई, सीधा थ्रो... और सीधा विकेटों पर हिट!शानदार फील्डिंग – बड़ा विकेट, रन आउट कर दिया गया है!',9:"गेंद हवा में गई है… फील्डर के नीचे है…और कैच पकड़ लिया! शानदार कैच – बल्लेबाज़ को लौटना होगा पवेलियन!टीम B को मिली बड़ी सफलता – दबाव रंग लाया!",10:"बोल्ड कर दिया! गिल्लियां बिखर गईं – क्या जबरदस्त गेंद थी!बल्लेबाज़ को कुछ समझ ही नहीं आया – रफ़्तार और लाइन का कमाल!टीम B को मिली बड़ी सफलता!",11: "पैड पर सीधी टक्कर… ज़ोरदार अपील… और अंपायर की उंगली ऊपर!आउट दिया गया – एलबीडब्ल्यू! बल्लेबाज़ पूरी तरह फंसा – कोई शक नहीं!गेंदबाज़ की ज़बरदस्त वापसी – टीम B को मिली अहम विकेट!",12: "रुकिए... अंपायर ने इशारा किया – डेड बॉल!कुछ गड़बड़ थी – शायद बल्लेबाज़ तैयार नहीं था या गेंद हाथ से फिसल गई।खेल थोड़ी देर रुका है, लेकिन रोमांच जारी रहेगा!",13:"ओह नहीं – यकीन नहीं होता!बल्लेबाज़ ने खुद ही गिरा दिए स्टंप्स – हिट विकेट आउट!ये तो बड़ी चूक थी – टीम B को मिला एक और तोहफ़ा!",14:"ये क्या! गेंदबाज़ का पैर लाइन के बाहर… अंपायर ने फैलाई अपनी बांह…ये नो बॉल है!अब मिलेगा फ्री हिट – गेंदबाज़ पर बढ़ा दबाव!"}
i=0
if(bat=='Team A'):
    print('टीम A अब बल्लेबाज़ी करने के लिए मैदान पर उतर चुकी है – ओपनर क्रीज़ पर आ चुके हैं, और स्टेडियम का माहौल गर्म है!चारों ओर बस एक ही आवाज़ – छक्के-चौकों की बरसात देखने को मिलेगी या गेंदबाज़ों का कहर?क्या टीम A बड़ा स्कोर बना पाएगी या टीम B की गेंदबाज़ी करेगी बाज़ी?पहली गेंद होने वाली है – और मैच में अब आएगा असली धमाका!')
else:
    print('टीम A अब बल्लेबाज़ी करने के लिए मैदान पर उतर चुकी है – ओपनर क्रीज़ पर आ चुके हैं, और स्टेडियम का माहौल गर्म है!चारों ओर बस एक ही आवाज़ – छक्के-चौकों की बरसात देखने को मिलेगी या गेंदबाज़ों का कहर?क्या टीम A बड़ा स्कोर बना पाएगी या टीम B की गेंदबाज़ी करेगी बाज़ी?पहली गेंद होने वाली है – और मैच में अब आएगा असली धमाका!')    
while(i<over):
    b = r.randint(1, 14)
    if (b > 5 and b != 7 and b != 8):
        print(ball[b])
        wicket += 1
        i+=1
    elif b <= 5:
        print(ball[b])
        run += ball[b]
        i+=1
    elif b == 7:
        print(ball[b])
        run += 1
        over+=1
    elif (b == 14 or b==12):
        print(ball[b])
        over+=1
    time.sleep(0.5)
if(bat=='Team A'):
    print('टीम A अब बल्लेबाज़ी करने के लिए मैदान पर उतर चुकी है – ओपनर क्रीज़ पर आ चुके हैं, और स्टेडियम का माहौल गर्म है!चारों ओर बस एक ही आवाज़ – छक्के-चौकों की बरसात देखने को मिलेगी या गेंदबाज़ों का कहर?क्या टीम A बड़ा स्कोर बना पाएगी या टीम B की गेंदबाज़ी करेगी बाज़ी?पहली गेंद होने वाली है – और मैच में अब आएगा असली धमाका!')
else:
    print('टीम A अब बल्लेबाज़ी करने के लिए मैदान पर उतर चुकी है – ओपनर क्रीज़ पर आ चुके हैं, और स्टेडियम का माहौल गर्म है!चारों ओर बस एक ही आवाज़ – छक्के-चौकों की बरसात देखने को मिलेगी या गेंदबाज़ों का कहर?क्या टीम A बड़ा स्कोर बना पाएगी या टीम B की गेंदबाज़ी करेगी बाज़ी?पहली गेंद होने वाली है – और मैच में अब आएगा असली धमाका!"')
i=0
while(i<over):
    b = r.randint(1, 14)
    if (b > 5 and b != 7 and b != 8):
        print(ball[b])
        wicket_2 += 1
        i+=1
    elif (b <= 5):
        print(ball[b])
        i+=1
        run_2 += ball[b]
    elif (b == 7):
        print(ball[b])
        over+=1
        run_2 += 1
    elif (b == 14 or b==12):
        print(ball[b])
        over+=1
    time.sleep(0.5)
if(run>run_2):
    print("\n और ये रहा आख़िरी पल! टीम A ने मुकाबला अपने नाम कर लिया है!शुरू से अंत तक शानदार प्रदर्शन – दबाव में भी नहीं डगमगाए और जीत का झंडा गाड़ दिया!मैदान में दौड़ पड़े खिलाड़ी – जश्न की शुरुआत हो चुकी है, टीम A ने जीत दर्ज की धमाकेदार अंदाज़ में!")
    print("पारी का समापन हो चुका है! टीम A ने 1 ओवर में ", wicket,' विकेट खोकर ',run, "रन बनाए हैं।शानदार बल्लेबाज़ी रही – अब गेंदबाज़ों की बारी है इस स्कोर की रक्षा करने की!")
    print("Wickets:", wicket_2)
else:
    print("\n और ये रहा आख़िरी पल! टीम A ने मुकाबला अपने नाम कर लिया है!शुरू से अंत तक शानदार प्रदर्शन – दबाव में भी नहीं डगमगाए और जीत का झंडा गाड़ दिया!मैदान में दौड़ पड़े खिलाड़ी – जश्न की शुरुआत हो चुकी है, टीम A ने जीत दर्ज की धमाकेदार अंदाज़ में!")
    print("पारी का समापन हो चुका है! टीम A ने 1 ओवर में ", wicket_2,' विकेट खोकर ',run_2, "रन बनाए हैं।शानदार बल्लेबाज़ी रही – अब गेंदबाज़ों की बारी है इस स्कोर की रक्षा करने की!")    

        



 
    
